taboadaa/ShuQi/nRF/Packages/.cache/Infineon.TLE984x_DFP.1.0.0.pdsc
				<device Dname="TLE9844-2QX">
					<processor Dclock="40000000"/>
					<compile header="Device\Include\TLE984x.h" define="TLE9844_2QX"/>
					<debug      svd="SVD\TLE984x.svd"/>
					<memory     id="IROM1"                      start="0x11000000"  size="0xF000"     startup="1"   default="1"/>
					<memory     id="IROM2"                      start="0x10FFFFFC"  size="4"          startup="0"   default="1"/>
					<memory     id="IRAM1"                      start="0x18000000"  size="0x1000"     init   ="0"   default="1"/>
					<algorithm  name="Flash\TLE9844_2.FLM"      start="0x11000000"  size="0x10000"                  default="1"/>
					<algorithm  name="Flash\TLE984x_OPT.FLM"    start="0x10FFFFFC"  size="4"                        default="1"/>
					<book    name="Documents\Infineon-TLE984xQX-UM-01_00-EN.pdf"    title="TLE984x Series User Manual"/>
					<book    name="Documents\Infineon-TLE984x-FWUM-01_01-EN.pdf"    title="TLE984x Series Firmware User Manual"/>
					<book    name="Documents\Infineon-TLE9844-2QX-DS-01_00-EN.pdf"  title="TLE9844-2QX Data Sheet"/>
					<feature type="ADC"           n="1"       m="10"/>
					<feature type="ADC"           n="1"       m="8"/>
					<feature type="IOs"           n="11"/>
				</device>
				<device Dname="TLE9845QX">
					<processor Dclock="40000000"/>
					<compile header="Device\Include\TLE984x.h" define="TLE9845QX"/>
					<debug      svd="SVD\TLE984x.svd"/>
					<memory     id="IROM1"                      start="0x11000000"  size="0xB000"     startup="1"   default="1"/>
					<memory     id="IROM2"                      start="0x10FFFFFC"  size="4"          startup="0"   default="1"/>
					<memory     id="IRAM1"                      start="0x18000000"  size="0x1000"     init   ="0"   default="1"/>
					<algorithm  name="Flash\TLE9845.FLM"        start="0x11000000"  size="0xC000"                   default="1"/>
					<algorithm  name="Flash\TLE984x_OPT.FLM"    start="0x10FFFFFC"  size="4"                        default="1"/>
					<book    name="Documents\Infineon-TLE984xQX-UM-01_00-EN.pdf"    title="TLE984x Series User Manual"/>
					<book    name="Documents\Infineon-TLE984x-FWUM-01_01-EN.pdf"    title="TLE984x Series Firmware User Manual"/>
					<book    name="Documents\Infineon-TLE9845QX-DS-01_00-EN.pdf"    title="TLE9845QX Data Sheet"/>
					<feature type="ADC"           n="1"       m="10"/>
					<feature type="ADC"           n="1"       m="8"/>
					<feature type="IOs"           n="11"/>
				</device>
			</subFamily>
		</family>
	</devices>

  <conditions>                                                                
  <!-- conditions are dependency rules that can apply to a component or an individual file -->
    <condition id="TLE984x CMSIS Device">                                     
    <!-- conditions selecting Devices -->
      <description>Infineon TLE984x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Cclass="Device" Cgroup="SDK" Csub="SCU"/>
      <require Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
      <require Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
      <require Cclass="Device" Cgroup="SDK" Csub="ISR"/>
      <require Cclass="Device" Cgroup="SDK" Csub="INT"/>
      <require Cclass="Device" Cgroup="SDK" Csub="PORT"/>
      <require Dvendor="Infineon:7" Dname="TLE984*QX"/>
    </condition>

    <condition id="TLE984x CMSIS Device Full">
      <description>Infineon TLE984x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Cclass="Device" Cgroup="SDK" Csub="SCU"/>
      <require Cclass="Device" Cgroup="SDK" Csub="PMU"/>
      <require Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
      <require Cclass="Device" Cgroup="SDK" Csub="ADC1"/>
      <require Cclass="Device" Cgroup="SDK" Csub="ADC2"/>
      <require Cclass="Device" Cgroup="SDK" Csub="PORT"/>
      <require Cclass="Device" Cgroup="SDK" Csub="MON"/>
      <require Cclass="Device" Cgroup="SDK" Csub="TIMER2x"/>
      <require Cclass="Device" Cgroup="SDK" Csub="GPT12E"/>
      <require Cclass="Device" Cgroup="SDK" Csub="CCU6"/>
      <require Cclass="Device" Cgroup="SDK" Csub="SSC"/>
      <require Cclass="Device" Cgroup="SDK" Csub="UART"/>
      <require Cclass="Device" Cgroup="SDK" Csub="LIN"/>
      <require Cclass="Device" Cgroup="SDK" Csub="HS"/>
      <require Cclass="Device" Cgroup="SDK" Csub="LS"/>
      <require Cclass="Device" Cgroup="SDK" Csub="ISR"/>
      <require Cclass="Device" Cgroup="SDK" Csub="INT"/>
      <require Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
      <require Dvendor="Infineon:7" Dname="TLE984*QX"/>
    </condition>

	<condition id="TLE984x">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE984x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE984*QX"/>
      <require Tcompiler="ARMCC"/>
    </condition>
 
    <condition id="TLE9842QX">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9842QX device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9842QX"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9842-2QX">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9842-2QX device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9842-2QX"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9843QX">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9843QX device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9843QX"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9843-2QX">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9843-2QX device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9843-2QX"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9844QX">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9844QX device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9844QX"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9844-2QX">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9844-2QX device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9844-2QX"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9845QX">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9845QX device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9845QX"/>
      <require Tcompiler="ARMCC"/>
    </condition>
