taboadaa/ShuQi/nRF/Packages/.cache/Infineon.TLE984x_DFP.1.0.0.pdsc
  </conditions>

  <boards>
    <board vendor="Infineon" name="TLE984x Eval.Board" revision="V1.0" salesContact="sales@infineon.com" orderForm="http://www.infineon.com/embeddedpower">
      <description>Infineon TLE984x Eval. Board Support and Examples</description>
      <image small="Images\TLE9844_EvalKit_v1_top_small.jpg" large="Images\TLE9844_EvalKit_v1_top_large.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/evaluation-boards/TLE9844+EVALKIT/evaluation-boards/TLE9844+EVALKIT/productType.html?productType=5546d4624e765da5014eb4e2cc3f2fc5" title="TLE9844 EvalKit Web Page"/>
      <!--<book category="setup"     name="Documents\TLE9844-EvalBoard-UM-100-Infineon.pdf" title="Getting Started"/>-->
      <book category="schematic" name="Documents\TLE984x_EVB_Rev12_UM_rev10.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="TLE9844QX"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE984x Series"/>
  	    <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
	    <feature type="PWR"       n="5"              name="USB Powered"/>
	    <feature type="PWR"       n="12" m="5"       name="POWER Connector for external supply"/>
	    <feature type="DIO"       n="13"             name="Pins at pin headers"/>
	    <feature type="AIO"       n="3"              name="Analog inputs at AD"/>
	    <feature type="LED"       n="8"              name="User LEDs"/>
      <debugInterface adapter="J-Link Lite" connector="Mini-USB"/>
    </board>
  </boards>

  <components>
    <component Cclass="Device" Cgroup="Startup with minimum SDK" Cversion="1.0.0" condition="TLE984x CMSIS Device">
      <description>System Startup for Infineon TLE984x device series with minimum SDK selection</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>
		
		<!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9842QX"   version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9842-2QX" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9843QX"   version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9843-2QX" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9844QX"   version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9844-2QX" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9845QX"   version="1.0"/>

		<!-- system file -->      
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9842QX"   version="1.0"/>
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9842-2QX" version="1.0"/>
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9843QX"   version="1.0"/>
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9843-2QX" version="1.0"/>
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9844QX"   version="1.0"/>
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9844-2QX" version="1.0"/>
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9845QX"   version="1.0"/>

        <file category="include" name="Device\SDK\cfgwiz\TLE9842QX\"   condition="TLE9842QX"/>
        <file category="include" name="Device\SDK\cfgwiz\TLE9842-2QX\" condition="TLE9842-2QX"/>
        <file category="include" name="Device\SDK\cfgwiz\TLE9843QX\"   condition="TLE9843QX"/>
        <file category="include" name="Device\SDK\cfgwiz\TLE9843-2QX\" condition="TLE9843-2QX"/>
        <file category="include" name="Device\SDK\cfgwiz\TLE9844QX\"   condition="TLE9844QX"/>
        <file category="include" name="Device\SDK\cfgwiz\TLE9844-2QX\" condition="TLE9844-2QX"/>
        <file category="include" name="Device\SDK\cfgwiz\TLE9845QX\"   condition="TLE9845QX"/>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="header"  name="Device\SDK\cfgwiz\TLE9842QX\bsl_defines.h"   attr="config" condition="TLE9842QX" version="1.1.1"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9842-2QX\bsl_defines.h" attr="config" condition="TLE9842-2QX" version="1.1.1"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9843QX\bsl_defines.h"   attr="config" condition="TLE9843QX" version="1.1.1"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9843-2QX\bsl_defines.h" attr="config" condition="TLE9843-2QX" version="1.1.1"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9844QX\bsl_defines.h"   attr="config" condition="TLE9844QX" version="1.1.1"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9844-2QX\bsl_defines.h" attr="config" condition="TLE9844-2QX" version="1.1.1"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9845QX\bsl_defines.h"   attr="config" condition="TLE9845QX" version="1.1.1"/>      

        <file category="sourceC" name="Device\SDK\app\main.c" attr="template" select="Simple Main" condition="TLE984x" version="1.1.1"/> 		
     </files>
    </component>

    <component Cclass="Device" Cgroup="Startup with full SDK" Cversion="1.0.0" condition="TLE984x CMSIS Device Full">
      <description>System Startup for Infineon TLE984x device series with full SDK selection</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>
		
		<!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9842QX"   version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9842-2QX" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9843QX"   version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9843-2QX" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9844QX"   version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9844-2QX" version="1.0"/>
        <file category="source" name="Device\Source\ARM\startup_TLE984x.s" condition="TLE9845QX"   version="1.0"/>

		<!-- system file -->      
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9842QX"   version="1.0"/>
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9842-2QX" version="1.0"/>
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9843QX"   version="1.0"/>
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9843-2QX" version="1.0"/>
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9844QX"   version="1.0"/>
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9844-2QX" version="1.0"/>
        <file category="source" name="Device\Source\system_TLE984x.c" condition="TLE9845QX"   version="1.0"/>

