taboadaa/ShuQi/nRF/Packages/.cache/Infineon.TLE984x_DFP.1.0.0.pdsc
        <file category="include" name="Device\SDK\cfgwiz\TLE9842QX\"   condition="TLE9842QX"/>
        <file category="include" name="Device\SDK\cfgwiz\TLE9842-2QX\" condition="TLE9842-2QX"/>
        <file category="include" name="Device\SDK\cfgwiz\TLE9843QX\"   condition="TLE9843QX"/>
        <file category="include" name="Device\SDK\cfgwiz\TLE9843-2QX\" condition="TLE9843-2QX"/>
        <file category="include" name="Device\SDK\cfgwiz\TLE9844QX\"   condition="TLE9844QX"/>
        <file category="include" name="Device\SDK\cfgwiz\TLE9844-2QX\" condition="TLE9844-2QX"/>
        <file category="include" name="Device\SDK\cfgwiz\TLE9845QX\"   condition="TLE9845QX"/>
        <file category="include" name="Device\SDK\cfgwiz\common\"/>
        <file category="header"  name="Device\SDK\cfgwiz\TLE9842QX\bsl_defines.h"   attr="config" condition="TLE9842QX" version="1.1.1"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9842-2QX\bsl_defines.h" attr="config" condition="TLE9842-2QX" version="1.1.1"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9843QX\bsl_defines.h"   attr="config" condition="TLE9843QX" version="1.1.1"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9843-2QX\bsl_defines.h" attr="config" condition="TLE9843-2QX" version="1.1.1"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9844QX\bsl_defines.h"   attr="config" condition="TLE9844QX" version="1.1.1"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9844-2QX\bsl_defines.h" attr="config" condition="TLE9844-2QX" version="1.1.1"/>      
        <file category="header"  name="Device\SDK\cfgwiz\TLE9845QX\bsl_defines.h"   attr="config" condition="TLE9845QX" version="1.1.1"/>      

        <file category="sourceC" name="Device\SDK\app_full\main.c" attr="template" select="Complete Main" condition="TLE984x" version="1.1.1"/> 		
     </files>
    </component>

	<!-- START: Infineon Standard Peripherals Low Level Drivers -->
    <component Cclass="Device" Cgroup="ConfigWizard" Cversion="1.1.1" condition="TLE984x">  <!-- Cversion is necessary -->
	 <description>Infineon ConfigWizard Configuration File</description>
	 <files>
        <file category="source" name="Device\SDK\cfgwiz\TLE9842QX\config.icwp" attr="config" condition="TLE9842QX" version="1.1.1"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9842-2QX\config.icwp" attr="config" condition="TLE9842-2QX" version="1.1.1"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9843QX\config.icwp" attr="config" condition="TLE9843QX" version="1.1.1"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9843-2QX\config.icwp" attr="config" condition="TLE9843-2QX" version="1.1.1"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9844QX\config.icwp" attr="config" condition="TLE9844QX" version="1.1.1"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9844-2QX\config.icwp" attr="config" condition="TLE9844-2QX" version="1.1.1"/>
        <file category="source" name="Device\SDK\cfgwiz\TLE9845QX\config.icwp" attr="config" condition="TLE9845QX" version="1.1.1"/>

        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\scu_defines.h" attr="config" condition="TLE9842QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\scu_defines.h" attr="config" condition="TLE9842-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\scu_defines.h" attr="config" condition="TLE9843QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\scu_defines.h" attr="config" condition="TLE9843-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\scu_defines.h" attr="config" condition="TLE9844QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\scu_defines.h" attr="config" condition="TLE9844-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\scu_defines.h" attr="config" condition="TLE9845QX" version="1.1.1"/>      

        <file category="header" name="Device\SDK\cfgwiz\common\pmu_defines.h" attr="config" condition="TLE984x" version="1.1.1"/>
		
        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\adc1_defines.h" attr="config" condition="TLE9842QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\adc1_defines.h" attr="config" condition="TLE9842-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\adc1_defines.h" attr="config" condition="TLE9843QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\adc1_defines.h" attr="config" condition="TLE9843-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\adc1_defines.h" attr="config" condition="TLE9844QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\adc1_defines.h" attr="config" condition="TLE9844-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\adc1_defines.h" attr="config" condition="TLE9845QX" version="1.1.1"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\adc2_defines.h" attr="config" condition="TLE9842QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\adc2_defines.h" attr="config" condition="TLE9842-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\adc2_defines.h" attr="config" condition="TLE9843QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\adc2_defines.h" attr="config" condition="TLE9843-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\adc2_defines.h" attr="config" condition="TLE9844QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\adc2_defines.h" attr="config" condition="TLE9844-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\adc2_defines.h" attr="config" condition="TLE9845QX" version="1.1.1"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\ccu6_defines.h" attr="config" condition="TLE9842QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\ccu6_defines.h" attr="config" condition="TLE9842-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\ccu6_defines.h" attr="config" condition="TLE9843QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\ccu6_defines.h" attr="config" condition="TLE9843-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\ccu6_defines.h" attr="config" condition="TLE9844QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\ccu6_defines.h" attr="config" condition="TLE9844-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\ccu6_defines.h" attr="config" condition="TLE9845QX" version="1.1.1"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\gpt12e_defines.h" attr="config" condition="TLE9842QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\gpt12e_defines.h" attr="config" condition="TLE9842-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\gpt12e_defines.h" attr="config" condition="TLE9843QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\gpt12e_defines.h" attr="config" condition="TLE9843-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\gpt12e_defines.h" attr="config" condition="TLE9844QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\gpt12e_defines.h" attr="config" condition="TLE9844-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\gpt12e_defines.h" attr="config" condition="TLE9845QX" version="1.1.1"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\hs_defines.h" attr="config" condition="TLE9842QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\hs_defines.h" attr="config" condition="TLE9842-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\hs_defines.h" attr="config" condition="TLE9843QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\hs_defines.h" attr="config" condition="TLE9843-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\hs_defines.h" attr="config" condition="TLE9844QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\hs_defines.h" attr="config" condition="TLE9844-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\hs_defines.h" attr="config" condition="TLE9845QX" version="1.1.1"/>      

        <file category="header" name="Device\SDK\cfgwiz\common\ls_defines.h" attr="config" condition="TLE984x" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\common\int_defines.h" attr="config" condition="TLE984x" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\common\isr_defines.h" attr="config" condition="TLE984x" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\common\lin_defines.h" attr="config" condition="TLE984x" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\common\mon_defines.h" attr="config" condition="TLE984x" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\common\port_defines.h" attr="config" condition="TLE984x" version="1.1.1"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\ssc_defines.h" attr="config" condition="TLE9842QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\ssc_defines.h" attr="config" condition="TLE9842-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\ssc_defines.h" attr="config" condition="TLE9843QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\ssc_defines.h" attr="config" condition="TLE9843-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\ssc_defines.h" attr="config" condition="TLE9844QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\ssc_defines.h" attr="config" condition="TLE9844-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\ssc_defines.h" attr="config" condition="TLE9845QX" version="1.1.1"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\timer2x_defines.h" attr="config" condition="TLE9842QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\timer2x_defines.h" attr="config" condition="TLE9842-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\timer2x_defines.h" attr="config" condition="TLE9843QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\timer2x_defines.h" attr="config" condition="TLE9843-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\timer2x_defines.h" attr="config" condition="TLE9844QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\timer2x_defines.h" attr="config" condition="TLE9844-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\timer2x_defines.h" attr="config" condition="TLE9845QX" version="1.1.1"/>      

        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\uart_defines.h" attr="config" condition="TLE9842QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\uart_defines.h" attr="config" condition="TLE9842-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\uart_defines.h" attr="config" condition="TLE9843QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\uart_defines.h" attr="config" condition="TLE9843-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\uart_defines.h" attr="config" condition="TLE9844QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\uart_defines.h" attr="config" condition="TLE9844-2QX" version="1.1.1"/>      
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\uart_defines.h" attr="config" condition="TLE9845QX" version="1.1.1"/>      

        <file category="source" name="Device\SDK\cfgwiz\script\IFX_TLE984x.xml" attr="config" condition="TLE984x" version="1.1.1"/>      
     </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="SCU" Cversion="0.2.9" condition="TLE984x CMSIS Device">
      <description>System Control Unit (SCU) driver for TLE984x</description>
      <files>
        <file category="include" name="Device\SDK\inc\"/>
        <file category="source"  name="Device\SDK\src\scu.c"/>      
      </files>
    </component>

